src/DataProcessors/ОплатаЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>ОплатаЗаказа</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>KilBil_ИДКлиента</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KilBil_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KilBil_КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KilBil_Баланс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KilBil_МаксимальнаяСуммаЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KilBil_МаксимальнаяСуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>KilBil_ОплатаБонусами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/ОплатаЗаказа/Ext/ObjectModule.bsl
// Вызывается из обработчика ПередОткрытием форм этой обработки,
// выполняет инициализацию рабочего места
//
Процедура ДействияПередОткрытиемФормы(ТекущаяФорма, Отказ) Экспорт
	
	//// ....
	
	Если СуммаКОплате>0 Тогда
		
		//Если ЗначениеЗаполнено(ВариантОплаты) Тогда
		//	ВыбВариантОплаты = ВариантОплаты;
		//Иначе
		//	ВыбВариантОплаты = ?( ЗначениеЗаполнено(Заказ.Клиент.ОсновнойВариантОплаты), Заказ.Клиент.ОсновнойВариантОплаты,
		//																			глПараметрыРМ.ОплатаОсновнойВариант );
		//КонецЕсли;
		//
		//Если ТаблицаВариантовОплаты.Найти(ВыбВариантОплаты, "ВариантОплаты") = Неопределено Тогда 
			ВыбВариантОплаты = ТаблицаВариантовОплаты[0].ВариантОплаты;
		//КонецЕсли;
		
		ЭлементыФормы.ПанельСумма.ТекущаяСтраница = ЭлементыФормы.ПанельСумма.Страницы.Оплата;
		ФормаОплаты.ТекущийЭлемент = ЭлементыФормы.ЗначениеВвода;
		
		ВыборВариантаОплаты(ВыбВариантОплаты);
		
		Если ЗначениеЗаполнено(ВариантОплаты) И ВариантОплаты.ОграничениеПоНабору Тогда
			ОК();
		КонецЕсли; 
		
		// если нет накопленных бонусов, то убираем панель информации о них
		Если НакопленияКлиента.СуммаБонусов=0 ИЛИ НЕ Защита.БлокДоступен("СкидкиБонусы") Тогда
			ЭлементыФормы.ПанельБонусы.Свертка = РежимСверткиЭлементаУправления.Верх;
			//ФормаОплаты.Высота = ФормаОплаты.Высота - (ЭлементыФормы.ПанельБонусы.Высота + 6);
			//ФормаОплаты.Высота = ФормаОплаты.Высота - (ЭлементыФормы.ПанельБонусы.Высота); // KilBil_БонуснаяСистема

		Иначе
			ЭлементыФормы.тБонусыКлиент.Заголовок = НСтр("de='Сумма бонусов (';en='Bonus amount (';ru='Сумма бонусов ('")+Заказ.Клиент.Наименование+")";
			ЭлементыФормы.тБонусыСумма .Заголовок = ФорматСумм(НакопленияКлиента.СуммаБонусов);
		КонецЕсли;
		
	Иначе
		ЭлементыФормы.ПанельБонусы.Свертка = РежимСверткиЭлементаУправления.Верх;
		//ФормаОплаты.Высота = ФормаОплаты.Высота - (ЭлементыФормы.ПанельБонусы.Высота + 6);
		//ФормаОплаты.Высота = ФормаОплаты.Высота - (ЭлементыФормы.ПанельБонусы.Высота); // KilBil_БонуснаяСистема
		
		ЭлементыФормы.ПанельСумма.ТекущаяСтраница = ЭлементыФормы.ПанельСумма.Страницы.Сдача;
		ЭлементыФормы.НадписьСуммаСдачи.Заголовок = Формат(-ЗначениеВвода,"ЧДЦ=2; ЧН=");
		ФормаОплаты.ТекущийЭлемент = ЭлементыФормы.КнопкаОК;
		ФлагЗавершения = 1;
		
	КонецЕсли;
	
	//// ....
	
	// KilBil_БонуснаяСистема 
	//// {
	Если KilBil_БонуснаяСистема.ИспользоватьБонуснуюСистему() Тогда
		Если ЗначениеЗаполнено(Заказ.KilBil_ИДКлиента) Тогда
			//Отказ = Ложь;
			
			Результат = KilBil_ТрактиръFrontOffice_4.ПолучитьМаксимальнуюСуммуСписания(Новый Структура("ИДКлиента, Документ", Заказ.KilBil_ИДКлиента, Заказ.Ссылка), Отказ);
			
			Если Отказ Тогда
				ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "", Результат.ОписаниеОшибки, "", "ОК", "");
				
				KilBil_ИДКлиента				= Неопределено;
				KilBil_МаксимальнаяСуммаБонусов = 0;
				KilBil_МаксимальнаяСуммаЧека	= 0;
				KilBil_Баланс					= 0;
				KilBil_НомерТелефона			= "";
			Иначе
				KilBil_ИДКлиента				= Заказ.KilBil_ИДКлиента;
				KilBil_МаксимальнаяСуммаБонусов = Мин(?(ЗначениеЗаполнено(Результат), Число(Результат.МаксимальнаяСуммаБонусов), 0), Заказ.KilBil_Баланс);
				KilBil_МаксимальнаяСуммаЧека	= Результат.МаксимальнаяСуммаЧека;
				KilBil_Баланс					= Заказ.KilBil_Баланс;
				KilBil_НомерТелефона			= Заказ.KilBil_НомерТелефона;
			КонецЕсли; 
		КонецЕсли; 	
	КонецЕсли;
	//// }
		
КонецПроцедуры

Процедура ОК(ГруппаОплаты = Неопределено, НеРаспределеннаяСумма = 0, ВариантОплатыУдалять = Истина) Экспорт
	
	Если ФлагЗавершения=1 Тогда
		// смену могли успеть закрыть с другого РМ
		ТекСмена = ИнтерфейсРМ.ТекущаяСмена(Заказ.МестоРеализации);
		Если НЕ ЗначениеЗаполнено(ТекСмена) Тогда
			Текст1=НСтр("en='Shift is closed!';ru='Смена закрыта!'");
			Текст2=НСтр("de='To complete the payment You need to open a shift!';en='To complete the payment You need to open a shift!';ru='Для завершения оплаты необходимо открыть смену!'");
			ИнтерфейсРМ.ВопросПредупреждение(НСтр("de='Warnung';en='Warning';ru='Предупреждение'"),Текст1,Текст2,"","ОК","");
			Возврат;
		КонецЕсли; 
		
		ФлагЗавершения=2;
		
		глОжидание.Начало(НСтр("de='Kassenbondruck…';en='Cheque printing…';ru='Печать чека...'"),
						НСтр("de='Die Datenaufzeichnung und der Rechnungsdruck auf Registrierkasse erfolgen. Bitte warten...';en='Data recording and cheque printing at the cash register are in progress. Please wait…';ru='Идет запись данных и печать чека на ККМ."
						"Пожалуйста, подождите...'"));
		
		Если ЗаказДопИнф.Статус = Перечисления.СтатусыЗаказа.Закрыт Тогда
			ПечатьЧековПоГруппам();
		Иначе
			ДобавитьВПротокол(); // сдача, если есть
			ЗаписатьОплату();
		КонецЕсли;
		
		Если НЕ Заказ.Бронь.Пустая() Тогда
			
			ТаблицаПредоплатПоГруппамОплаты = ПолучитьТаблицуПредоплатПоБрони(Заказ.Бронь);
			
			Если ТаблицаПредоплатПоГруппамОплаты.Итог("Сумма")>0 И глПараметрыРМ.БроньПредоплатаРежимВозврата > 1 Тогда
				Бронь = Заказ.Бронь.ПолучитьОбъект();
				Бронь.Закрыто = Ложь;
				Бронь.Записать(РежимЗаписиДокумента.Проведение);	
			КонецЕсли;
			
		КонецЕсли; 
		
		глОжидание.Конец();
		
		// KilBil_БонуснаяСистема 
		//// { 
		Если KilBil_БонуснаяСистема.ИспользоватьБонуснуюСистему() Тогда
			Если ЗначениеЗаполнено(KilBil_ИДКлиента) Тогда
				Отказ = Ложь;
				
				Если НЕ KilBil_ОплатаБонусами Тогда
					Параметры = Новый Структура;
					Параметры.Вставить("ИДКлиента", 			KilBil_ИДКлиента);
					Параметры.Вставить("СуммаБонусов", 			0);
					Параметры.Вставить("МаксимальнаяСуммаЧека", KilBil_МаксимальнаяСуммаЧека);
					Параметры.Вставить("Документ", 				Заказ);
					
					Результат = KilBil_ТрактиръFrontOffice_4.ОтправитьДокумент(Параметры, Отказ);
					
					ИтогоНачислено = 0;
					
					Если Отказ Тогда
						ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "", Результат.ОписаниеОшибки, "", "ОК", "");	
						
						Возврат;
					Иначе
						СтруктураДокумента = Результат.СтруктураДокумента;
						
						Для Каждого СтрокаТабличнойЧасти Из Заказ.Товары Цикл
							СтруктураСтроки = СтруктураДокумента.items[СтрокаТабличнойЧасти.НомерСтроки - 1];
							ИтогоНачислено = ИтогоНачислено + СтруктураСтроки.bonus_in;
						КонецЦикла;	
					КонецЕсли; 
					
					Заказ.KilBil_Списано   = 0;
					Заказ.KilBil_Начислено = ИтогоНачислено;		
				КонецЕсли; 
				
				
				Результат = KilBil_ТрактиръFrontOffice_4.ЗакрытьДокумент(Новый Структура("Документ", Заказ), Отказ);
				
				Если Отказ Тогда
					ИнтерфейсРМ.ВопросПредупреждение("Ошибка", "", Результат.ОписаниеОшибки, "", "ОК", "");	
				КонецЕсли; 
			КонецЕсли;
		КонецЕсли; 
		//// }
		
		Если НЕ глПараметрыРМ.ОплатаНеЗакрыватьСразу Тогда
			ФормаОплаты.Закрыть();
		КонецЕсли;
		
		Возврат;
		
	ИначеЕсли ФлагЗавершения=2 Тогда
		ФормаОплаты.Закрыть();
		Возврат;
		
	КонецЕсли;
	
	//// ....
	
КонецПроцедуры
